W9D1/Art_Share_Day1/FirstRoutes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 33], ["updated_at", "2019-08-27 21:09:27.051893"], ["id", 12]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)