W9D1/Art_Share_Day1/FirstRoutes/app/controllers/artwork_shares_controller.rb

    def create
        viewer = User.find(params[:artwork_share][:viewer_id])
        artwork = Artwork.find(params[:artwork_share][:artwork_id])
        if viewer && artwork
            share = ArtworkShare.new(artwork_share_params)
        end
        if share.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "artwork_shares" ("created_at", "updated_at", "artwork_id", "viewer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-08-27 22:09:03.047404"], ["updated_at", "2019-08-27 22:09:03.047404"], ["artwork_id", 7], ["viewer_id", 31]]

    def destroy
        share = ArtworkShare.find(params[:id])
        if share
            share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]