W9D5/music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def new
       if !logged_in?
         flash[:errors]= "Please log in or sign up to submit a band"
         redirect_to new_session_url
         return
       else
        @band = Band.find_by(name: params[:name])