W9D5/music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "j5HdrAXgHh5x2zaZtoADMg"], ["updated_at", "2019-08-31 17:00:48.951799"], ["id", 1]]