W9D2/FirstRoutes_day_2/FirstRoutes_day_2/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-08-27 20:28:56.487206"], ["updated_at", "2019-08-27 20:28:56.487206"], ["username", "Garfield"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Sandeex"], ["updated_at", "2019-08-27 20:30:52.253576"], ["id", 28]]
---
    def update
        user = User.find(params[:id])
        if user
            user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
    def destroy
        user = User.find(params[:id])
        if user
            user.destroy